Тестовая_база_ERP_14/src/Catalogs/РЭЙ_ВидыВалютныхОпераций/РЭЙ_ВидыВалютныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_ВидыВалютныхОпераций</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КонверсионныеОперацииРезидентовВБезналичнойФорме</name>
      <description>Конверсионные операции резидентов в безналичной форме</description>
    </items>
    <items>
      <name>КонверсионныеОперацииНерезидентовВБезналичнойФорме</name>
      <description>Конверсионные операции нерезидентов в безналичной форме</description>
    </items>
    <items>
      <name>РасчетыПереводыМеждуРезидентамиНерезидентамиЗаТоварыВывозимыеСТаможеннойТерриторииРФ</name>
      <description>Расчеты между резидентами и нерезидентами по сделкам ВЭД, связанной с вывозом с территории РФ товаров, вкл. различные суда и космические объекты</description>
    </items>
    <items>
      <name>РасчетыПереводыМеждуРезидентамиНерезидентамиЗаТоварыВвозимыеНаТаможеннуюТерриториюРФ</name>
      <description>Расчеты между резидентами и нерезидентами по сделкам ВЭД, связанной с ввозом на территорию РФ товаров, вкл. различные суда и космические объекты</description>
    </items>
    <items>
      <name>РасчетыПереводыМеждуРезидентамиНерезидентамиЗаТоварыБезИхВвозаНаТаможеннуюТерриториюРФ</name>
      <description>Расчеты между резидентами и нерезидентами за продаваемые товары без их ввоза на территорию РФ</description>
    </items>
    <items>
      <name>РасчетыПереводыМеждуРезидентамиНерезидентамиЗаТоварыНаТерриторииРФ</name>
      <description>Расчеты между резидентами и нерезидентами за продаваемые товары на территории РФ</description>
    </items>
    <items>
      <name>РасчетыПереводыНерезидентовВПользуРезидентовПоВнешнеторговымСделкам</name>
      <description>Расчеты между резидентами и нерезидентам по сделкам ВЭД, связанным с выполнением резидентами работ/услуг, передачей информации и результатов ИД</description>
    </items>
    <items>
      <name>РасчетыПереводыОтРезидентовВПользуНерезидентовПоВнешнеторговымСделкам</name>
      <description>Расчеты между резидентами и нерезидентами по сделкам ВЭД, связанным с выполнением нерезидентами работ/услуг, передачей информации и результатов ИД</description>
    </items>
    <items>
      <name>РасчетыМеждуРезидентамиИНерезидентамиПоПередачеРезидентамиТоваровУслуг</name>
      <description>Расчеты между резидентами и нерезидентами, связанные с передачей резидентами товаров, работ/услуг, информации и результатов ИД</description>
    </items>
    <items>
      <name>РасчетыМеждуРезидентамиИНерезидентамиПоПередачеНерезидентамиТоваровУслуг</name>
      <description>Расчеты между резидентами и нерезидентами, связанные с передачей нерезидентами товаров, работ/услуг, информации и результатов ИД</description>
    </items>
    <items>
      <name>РасчетыПереводыМеждуРезидентамиНерезидентамиПоОперациямСНедвижимымИмуществом</name>
      <description>Расчеты между резидентами и нерезидентами по операциям с недвижимым имуществом, за исключением платежей за различные суда и космические объекты</description>
    </items>
    <items>
      <name>РасчетыМеждуРезидентамиИНерезидентамиПоДоговорамУступкиТребования</name>
      <description>Расчеты между резидентами и нерезидентами в соответствии с договорами уступки требования,перевода долга,заключенными между резидентами и нерезидентами</description>
    </items>
    <items>
      <name>РасчетыПереводыМеждуРезидентамиНерезидентамиПопрочимОперациям</name>
      <description>Расчеты между резидентами и нерезидентами по прочим операциям, связанным с ВЭД и прямо не указанным в группах 10-23 настоящего Перечня</description>
    </items>
    <items>
      <name>РасчетыПереводыСвязанныеСПредоставлениемРезидентамиНерезидентамКредитовЗаймов</name>
      <description>Расчеты, связанные с предоставлением резидентами, за исключением уполномоченных банков, нерезидентам денежных средств по договорам займа</description>
    </items>
    <items>
      <name>РасчетыПереводыСвязанныеСПредоставлениемНерезидентамиРезидентамКредитовЗаймов</name>
      <description>Расчеты, связанные с предоставлением нерезидентами резидентам, за исключением уполномоченных банков, кредитов и займов</description>
    </items>
    <items>
      <name>РасчетыПереводыМеждуРезидентамиНерезидентамиСвязанныеСИсполнениемРезидентамиОбязательствПоПривлеченнымКредитамЗаймам</name>
      <description>Расчеты между резидентами и нерезидентами, за искл.уполномоч.банков,связанные с исполнением резидентами обязательств по привлеченным кредитам и займам</description>
    </items>
    <items>
      <name>РасчетыПереводыМеждуРезидентамиНерезидентамиСвязанныеСИсполнениемНерезидентамиОбязательствПоПривлеченнымЗаймам</name>
      <description>Расчеты, связанные с исполнением нерезидентами обязательств по привлеченным в денежной форме займам по договорам займа</description>
    </items>
    <items>
      <name>РасчетыПереводыСвязанныеСИнвестициямиВФормеКапитальныхВложений</name>
      <description>Расчеты, связанные с инвестициями в форме капитальных вложений</description>
    </items>
    <items>
      <name>РасчетыПереводыСвязанныеСПриобретениемНерезидентамиУРезидентовВнутреннихЦенныхБумаг</name>
      <description>Расчеты,связанные с приобретением нерезидентами у резидентов ценных бумаг (удостоверенных прав) за искл.расчетов по кодам группы 58 настоящего Перечня</description>
    </items>
    <items>
      <name>РасчетыПереводыСвязанныеСОтчуждениемНерезидентомВПользуРезидентаВнутреннихЦенныхБумаг</name>
      <description>Расчеты,связанные с приобретением резидентами у нерезидентов ценных бумаг (удостоверенных прав) за искл.расчетов по кодам группы 58 настоящего Перечня</description>
    </items>
    <items>
      <name>РасчетыПереводыСвязанныеСИсполнениемРезидентамиНерезидентамиОбязательствПоЦеннымБумагам</name>
      <description>Расчеты, связанные с исполнением резидентами и нерезидентами обязательств по ценным бумагам, за искл. расчетов по кодам группы 58 настоящего Перечня</description>
    </items>
    <items>
      <name>РасчетыПереводыПоОперациямСоСрочнымиПроизводнымиФинансовымиИнструментами</name>
      <description>Расчеты между резидентами и нерезидентами по операциям с производными финансовыми инструментами и прочим срочным сделкам</description>
    </items>
    <items>
      <name>РасчетыПоДоговорамДоверительногоУправленияИмуществом</name>
      <description>Расчеты по договорам доверительного управления имуществом</description>
    </items>
    <items>
      <name>РасчетыПоДоговорамБрокерскогоОбслуживания</name>
      <description>Расчеты по договорам о брокерском обслуживании, за исключением расчетов по кодам групп 51-55 настоящего Перечня</description>
    </items>
    <items>
      <name>ПереводыПоСчетамНерезидентов</name>
      <description>Переводы нерезидентов, снятие (зачисление) наличной валюты РФ, осуществляемые по счетам нерезидентов в валюте РФ</description>
    </items>
    <items>
      <name>ПереводыСОдногоСчетаРезидентаНаДругойСчетРезидента</name>
      <description>Расчеты и переводы резидентов, снятие (зачисление) резидентами наличной иностранной валюты</description>
    </items>
    <items>
      <name>НеторговыеОперации</name>
      <description>Неторговые операции</description>
    </items>
    <items>
      <name>РасчетыМеждуБанкомИНерезидентомВРубляхИМеждуБанкомИРезидентомВИнвалюте</name>
      <description>Расчеты между уполномоченным банком и нерезидентом в валюте РФ и между уполномоченным банком и резидентом в иностранной валюте</description>
    </items>
    <items>
      <name>РасчетыПереводыПоПрочимВалютнымОперациям</name>
      <description>Расчеты по прочим валютным операциям, прямо не указанным в группах 01-80 настоящего Перечня</description>
    </items>
  </predefined>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВозвратаАванса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_ВидыВалютныхОпераций/ManagerModule.bsl
Процедура Инициализировать() Экспорт
	Макет = Справочники.РЭЙ_ВидыВалютныхОпераций.ПолучитьМакет("КлассификаторВидовВалютныхОпераций");
	
	ТекущаяГруппа = Неопределено;
	Для т = 5 по Макет.ВысотаТаблицы Цикл
		Если Макет.Область(т, 1).Шрифт.Жирный Тогда
			текСсылка = Справочники.РЭЙ_ВидыВалютныхОпераций.НайтиПоКоду(Макет.Область(т, 2).Текст + "000");
			Если ЗначениеЗаполнено(текСсылка) Тогда
				текОбъект = текСсылка.ПолучитьОбъект();
			Иначе
				текОбъект = Справочники.РЭЙ_ВидыВалютныхОпераций.СоздатьГруппу();
			КонецЕсли;
			текОбъект.Код = Макет.Область(т, 2).Текст + "000";
			текОбъект.Наименование = Макет.Область(т, 3).Текст;
			текОбъект.НаименованиеПолное = Макет.Область(т, 3).Текст;
			текОбъект.Записать();
			ТекущаяГруппа = текОбъект.Ссылка;
		Иначе
			текСсылка = Справочники.РЭЙ_ВидыВалютныхОпераций.НайтиПоКоду(Макет.Область(т, 2).Текст);
			Если ЗначениеЗаполнено(текСсылка) Тогда
				текОбъект = текСсылка.ПолучитьОбъект();
			Иначе
				текОбъект = Справочники.РЭЙ_ВидыВалютныхОпераций.СоздатьЭлемент();
			КонецЕсли;
			текОбъект.Код = Макет.Область(т, 2).Текст;
			текОбъект.Родитель = ТекущаяГруппа;
			текОбъект.Наименование = Макет.Область(т, 3).Текст;
			текОбъект.НаименованиеПолное = Макет.Область(т, 3).Текст;
			текОбъект.ОжидаемыйСрок = Не ПустаяСтрока(Макет.Область(т, 4).Текст);
			текОбъект.СрокВозвратаАванса = Не ПустаяСтрока(Макет.Область(т, 5).Текст);
			текОбъект.Возврат = Не ПустаяСтрока(Макет.Область(т, 6).Текст);
			текОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
